ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tcpwm.h
/***************************************************************************//**
* \file cy_tcpwm.h
* \version 1.10
*
* The header file of the TCPWM driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_tcpwm
* \{
* \defgroup group_tcpwm_common  Common
* \defgroup group_tcpwm_counter Timer/Counter (TCPWM)
* \defgroup group_tcpwm_pwm     PWM (TCPWM)
* \defgroup group_tcpwm_quaddec Quadrature Decoder (TCPWM)
* \} */

/**
* \addtogroup group_tcpwm
* \{
* 
* The TCPWM driver is a multifunction driver that implements Timer Counter, 
* PWM, and Quadrature Decoder functionality using the TCPWM block.
*
* The functions and other declarations used in this driver are in cy_tcpwm_counter.h, 
* cy_tcpwm_pwm.h, cy_tcpwm_quaddec.h respectively. Include cy_pdl.h 
* (ModusToolbox only) to get access to all functions and declarations in the PDL.
*
* Each TCPWM block is a collection of counters that can all be triggered 
* simultaneously. For each function call, the base register address of 
* the TCPWM being used must be passed first, followed by the index of 
* the counter you want to touch next. 
* For some functions, you can manage multiple counters simultaneously. You 
* provide a bit field representing each counter, rather than the single counter 
* index). 
*
* The TCPWM supports three operating modes:
* * Timer/Counter
* * PWM
* * Quadrature Decoder
*
* \n
* \b Timer/Counter
*
* Use this mode whenever a specific timing interval or measurement is 
* needed. Examples include:
* * Creating a periodic interrupt for running other system tasks
* * Measuring frequency of an input signal
* * Measuring pulse width of an input signal
* * Measuring time between two external events
* * Counting events
* * Triggering other system resources after x number events
* * Capturing time stamps when events occur
*
* The Timer/Counter has the following features:
* * 16- or 32-bit Timer/Counter
* * Programmable Period Register
* * Programmable Compare Register. Compare value can be swapped with a 
* buffered compare value on comparison event
* * Capture with buffer register
* * Count Up, Count Down, or Count Up and Down Counting modes
* * Continuous or One Shot Run modes
* * Interrupt and Output on Overflow, Underflow, Capture, or Compare 
* * Start, Reload, Stop, Capture, and Count Inputs
*
* \n
* \b PWM
*
* Use this mode when an output square wave is needed with a specific 
* period and duty cycle, such as:
* * Creating arbitrary square wave outputs
* * Driving an LED (changing the brightness)
* * Driving Motors (dead time assertion available)
*
* The PWM has the following features:
* * 16- or 32-bit Counter
* * Two Programmable Period registers that can be swapped
* * Two Output Compare registers that can be swapped on overflow and/or 
* underflow
* * Left Aligned, Right Aligned, Center Aligned, and Asymmetric Aligned modes
* * Continuous or One Shot run modes
* * Pseudo Random mode
* * Two PWM outputs with Dead Time insertion, and programmable polarity
* * Interrupt and Output on Overflow, Underflow, or Compare 
* * Start, Reload, Stop, Swap (Capture), and Count Inputs
* * Multiple Components can be synchronized together for applications 
* such as three phase motor control
*
* \n
* \b Quadrature \b Decoder
*
* A quadrature decoder is used to decode the output of a quadrature encoder. 
* A quadrature encoder senses the position, velocity, and direction of 
* an object (for example a rotating axle, or a spinning mouse ball). 
* A quadrature decoder can also be used for precision measurement of speed, 
* acceleration, and position of a motor's rotor, or with a rotary switch to 
* determine user input. \n
* 
* The Quadrature Decoder has the following features:
* * 16- or 32-bit Counter
* * Counter Resolution of x1, x2, and x4 the frequency of the phiA (Count) and 
* phiB (Start) inputs
* * Index Input to determine absolute position
* * A positive edge on phiA increments the counter when phiB is 0 and decrements
* the counter when phiB is 1
*
* \section group_tcpwm_configuration Configuration Considerations
*
* For each mode, the TCPWM driver has a configuration structure, an Init 
* function, and an Enable function. 
*
* Provide the configuration parameters in the appropriate structure (see
* Counter \ref group_tcpwm_data_structures_counter, PWM 
* \ref group_tcpwm_data_structures_pwm, or QuadDec 
* \ref group_tcpwm_data_structures_quaddec). 
* Then call the appropriate Init function: 
* \ref Cy_TCPWM_Counter_Init, \ref Cy_TCPWM_PWM_Init, or 
* \ref Cy_TCPWM_QuadDec_Init. Provide the address of the filled structure as a 
* parameter. To enable the counter, call the appropriate Enable function: 
* \ref Cy_TCPWM_Counter_Enable, \ref Cy_TCPWM_PWM_Enable, or 
* \ref Cy_TCPWM_QuadDec_Enable).
*
* Many functions work with an individual counter. You can also manage multiple 
* counters simultaneously for certain functions. These are listed in the 
* \ref group_tcpwm_functions_common 
* section of the TCPWM. You can enable, disable, or trigger (in various ways) 
* multiple counters simultaneously. For these functions you provide a bit field 
* representing each counter in the TCPWM you want to control. You can 
* represent the bit field as an ORed mask of each counter, like 
* ((1U << cntNumX) | (1U << cntNumX) | (1U << cntNumX)), where X is the counter 
* number from 0 to 31.
*
* \note
* * If none of the input terminals (start, reload(index)) are used, the 
* software event \ref Cy_TCPWM_TriggerStart or 
* \ref Cy_TCPWM_TriggerReloadOrIndex must be called to start the counting.
* * If count input terminal is not used, the \ref CY_TCPWM_INPUT_LEVEL macro 
* should be set for the countInputMode parameter and the \ref CY_TCPWM_INPUT_1 
* macro should be set for the countInput parameter in the configuration 
* structure of the appropriate mode(Counter 
* \ref group_tcpwm_data_structures_counter, PWM 
* \ref group_tcpwm_data_structures_pwm, or QuadDec 
* \ref group_tcpwm_data_structures_quaddec).
*
* \subsection group_tcpwm_pins Assign and Configure Pins
* The dedicated TCPWM pins can be used. The HSIOM register must be configured to
* connect the block to the pins. Use the \ref group_gpio driver API to do that.
*
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_Pins
*
* \subsection group_tcpwm_clock Assign Clock Divider
* The clock source must be connected to proper working.
* Any of the peripheral clock dividers could be used. Use the  
* \ref group_sysclk driver API to do that.
*
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_Clock
*
* \section group_tcpwm_more_information More Information
*
* For more information on the TCPWM peripheral, refer to the technical 
* reference manual (TRM).
*
* \section group_tcpwm_MISRA MISRA-C Compliance 
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>14.2</td>
*     <td>R</td>
*     <td>All non-null statements shall either: a) have at least one side-effect
*         however executed, or b) cause control flow to change.</td>
*     <td>The unused function parameters are cast to void. This statement
*         has no side-effect and is used to suppress a compiler warning.</td>
*   </tr>
* </table>
*
* \section group_tcpwm_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="2">1.10</td>
*     <td>Flattened the organization of the driver source code into the single 
*         source directory and the single include directory.
*     </td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>Added register access layer. Use register access macros instead
*         of direct register access using dereferenced pointers.</td>
*     <td>Makes register access device-independent, so that the PDL does 
*         not need to be recompiled for each supported part number.</td>
*   </tr>
*   <tr>
*     <td>1.0.1</td>
*     <td>Added a deviation to the MISRA Compliance section.
*         Added function-level code snippets.</td>
*     <td>Documentation update and clarification</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*/

